wastegate711/Pult/stm32f4xx.svd
        <register>          <name>FS_HCINTMSK2</name>
          <displayName>FS_HCINTMSK2</displayName>
          <description>OTG_FS host channel-2 mask register
          (OTG_FS_HCINTMSK2)</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>              <name>XFRCM</name>
              <description>Transfer completed mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>CHHM</name>
              <description>Channel halted mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>STALLM</name>
              <description>STALL response received interrupt
              mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>NAKM</name>
              <description>NAK response received interrupt
              mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>ACKM</name>
              <description>ACK response received/transmitted
              interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>NYET</name>
              <description>response received interrupt
              mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>TXERRM</name>
              <description>Transaction error mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>BBERRM</name>
              <description>Babble error mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>FRMORM</name>
              <description>Frame overrun mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>DTERRM</name>
              <description>Data toggle error mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>          <name>FS_HCINTMSK3</name>
          <displayName>FS_HCINTMSK3</displayName>
          <description>OTG_FS host channel-3 mask register
          (OTG_FS_HCINTMSK3)</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>              <name>XFRCM</name>
              <description>Transfer completed mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>CHHM</name>
              <description>Channel halted mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>STALLM</name>
              <description>STALL response received interrupt
              mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>NAKM</name>
              <description>NAK response received interrupt
              mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>ACKM</name>
              <description>ACK response received/transmitted
              interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>NYET</name>
              <description>response received interrupt
              mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>TXERRM</name>
              <description>Transaction error mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>BBERRM</name>
              <description>Babble error mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>FRMORM</name>
              <description>Frame overrun mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>DTERRM</name>
              <description>Data toggle error mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>          <name>FS_HCINTMSK4</name>
          <displayName>FS_HCINTMSK4</displayName>
          <description>OTG_FS host channel-4 mask register
          (OTG_FS_HCINTMSK4)</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>              <name>XFRCM</name>
              <description>Transfer completed mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>CHHM</name>
              <description>Channel halted mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>STALLM</name>
              <description>STALL response received interrupt
              mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>NAKM</name>
              <description>NAK response received interrupt
              mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>ACKM</name>
              <description>ACK response received/transmitted
              interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>NYET</name>
              <description>response received interrupt
              mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>TXERRM</name>
              <description>Transaction error mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>BBERRM</name>
              <description>Babble error mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>FRMORM</name>
              <description>Frame overrun mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>DTERRM</name>
              <description>Data toggle error mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>          <name>FS_HCINTMSK5</name>
          <displayName>FS_HCINTMSK5</displayName>
          <description>OTG_FS host channel-5 mask register
          (OTG_FS_HCINTMSK5)</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>              <name>XFRCM</name>
              <description>Transfer completed mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>CHHM</name>
              <description>Channel halted mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>STALLM</name>
              <description>STALL response received interrupt
              mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>NAKM</name>
              <description>NAK response received interrupt
              mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>ACKM</name>
              <description>ACK response received/transmitted
              interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>NYET</name>
              <description>response received interrupt
              mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>TXERRM</name>
              <description>Transaction error mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>BBERRM</name>
              <description>Babble error mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>FRMORM</name>
              <description>Frame overrun mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>DTERRM</name>
              <description>Data toggle error mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>          <name>FS_HCINTMSK6</name>
          <displayName>FS_HCINTMSK6</displayName>
          <description>OTG_FS host channel-6 mask register
          (OTG_FS_HCINTMSK6)</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>              <name>XFRCM</name>
              <description>Transfer completed mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>CHHM</name>
              <description>Channel halted mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>STALLM</name>
              <description>STALL response received interrupt
              mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>NAKM</name>
              <description>NAK response received interrupt
              mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>ACKM</name>
              <description>ACK response received/transmitted
              interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>NYET</name>
              <description>response received interrupt
              mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>TXERRM</name>
              <description>Transaction error mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>BBERRM</name>
              <description>Babble error mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>FRMORM</name>
              <description>Frame overrun mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>              <name>DTERRM</name>
              <description>Data toggle error mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
