wastegate711/Pult/stm32f4xx.svd
        <register>          <name>OTG_HS_DIEPDMA1</name>
          <displayName>OTG_HS_DIEPDMA1</displayName>
          <description>OTG_HS device endpoint-1 DMA address
          register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>              <name>DMAADDR</name>
              <description>DMA address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>          <name>OTG_HS_DIEPDMA2</name>
          <displayName>OTG_HS_DIEPDMA2</displayName>
          <description>OTG_HS device endpoint-2 DMA address
          register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>              <name>DMAADDR</name>
              <description>DMA address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>          <name>OTG_HS_DIEPDMA3</name>
          <displayName>OTG_HS_DIEPDMA3</displayName>
          <description>OTG_HS device endpoint-3 DMA address
          register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>              <name>DMAADDR</name>
              <description>DMA address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>          <name>OTG_HS_DIEPDMA4</name>
          <displayName>OTG_HS_DIEPDMA4</displayName>
          <description>OTG_HS device endpoint-4 DMA address
          register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>              <name>DMAADDR</name>
              <description>DMA address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>          <name>OTG_HS_DIEPDMA5</name>
          <displayName>OTG_HS_DIEPDMA5</displayName>
          <description>OTG_HS device endpoint-5 DMA address
          register</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>              <name>DMAADDR</name>
              <description>DMA address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>          <name>OTG_HS_DTXFSTS0</name>
          <displayName>OTG_HS_DTXFSTS0</displayName>
          <description>OTG_HS device IN endpoint transmit FIFO
          status register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space
              avail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>          <name>OTG_HS_DTXFSTS1</name>
          <displayName>OTG_HS_DTXFSTS1</displayName>
          <description>OTG_HS device IN endpoint transmit FIFO
          status register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space
              avail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>          <name>OTG_HS_DTXFSTS2</name>
          <displayName>OTG_HS_DTXFSTS2</displayName>
          <description>OTG_HS device IN endpoint transmit FIFO
          status register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space
              avail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>          <name>OTG_HS_DTXFSTS3</name>
          <displayName>OTG_HS_DTXFSTS3</displayName>
          <description>OTG_HS device IN endpoint transmit FIFO
          status register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space
              avail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>          <name>OTG_HS_DTXFSTS4</name>
          <displayName>OTG_HS_DTXFSTS4</displayName>
          <description>OTG_HS device IN endpoint transmit FIFO
          status register</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space
              avail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
